{"data":{"site":{"siteMetadata":{"title":"Vitor Reis Blog","author":"Vitor Reis"}},"markdownRemark":{"id":"2d3c78df-d6c4-5ee5-b1aa-25968fb230d7","excerpt":"At JAX London a few weeks ago I attended the talk of @danielbryantuk about Continuous Delivery With Containers, where he gave a few samples of his book…","html":"<p>At JAX London a few weeks ago I attended the talk of <a href=\"https://twitter.com/danielbryantuk\">@danielbryantuk</a> about Continuous Delivery With Containers, where he gave a few samples of his book <a href=\"https://www.nginx.com/resources/library/containerizing-continuous-delivery-java/\">Containerizing Continuous Delivery in Java</a> (get a free copy on the link).</p>\n<p>The book it’s easy to read, thin and straight to the point, in 53 pages the author gives a small review/context about the topic there discussed, and demonstrates conceptually and practically how to implement a flow of continuous delivery of a java application using Docker as container technology and Jenkins as tool for automation of the flow, the book is not about how to write Dockerfiles for this purpose the author recommends <a href=\"http://www.oreilly.com/programming/free/docker-for-java-developers.csp\">Docker for Java Developers</a> (Also available for free in the link) from Arun Gupta. The author flags the questions and important concepts that you should consider while implementing such a flow, he raises our awareness on common mistakes but this is just the tip of the iceberg, it’s a nice starting point on the topic.</p>\n<p>In the real world, your company might be using other tools for continuous integration (e.g.: CircleCI, Travis) and you might have to adapt the proposed flow to the resources that your tool give to you, also if your cluster runs inside a VPN you may have to handle the security implications of your CI/CD tool connecting in the VPN. I felt that the author stopped in the “staging/test” environment, I missed comments about a pipeline/barrier mechanism for the production environment.</p>\n<p>Recommended read for who is considering to adopt this flow and don’t have nothing similar implemented yet.</p>\n<p>Kudos to the author for the useful <a href=\"https://github.com/danielbryantuk/oreilly-docker-java-shopping\">open source repository</a>.</p>","frontmatter":{"title":"A Practical guide to CD Java Applications","date":"October 19, 2017","description":"At JAX London 2017 there was an interesting talk about the state of the art on CD for Java Apps"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/a-practical-guide-to-cd-java-applications/","previous":{"fields":{"slug":"/jax-london-2017/"},"frontmatter":{"title":"Jax London 2017 - Conference Highlights"}},"next":{"fields":{"slug":"/implementing-scrum-a-case-study/"},"frontmatter":{"title":"Implementing Scrum - A case study"}}}}