{"data":{"site":{"siteMetadata":{"title":"Vitor Reis Blog"}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"Manual testing is by far one of the most painful things in the software development lifecycle, as your products evolve and more…","fields":{"slug":"/2019/end-to-end-test-automation/"},"frontmatter":{"date":"November 21, 2019","title":"End to End test automation for web apps","description":"It's here. Test automation made simple."}}},{"node":{"excerpt":"BackgroundOn Q3 2018 I started on the journey of building a new cross-functional team for a greenfield project. We started it with a product…","fields":{"slug":"/2019/implementing-scrum-a-case-study/"},"frontmatter":{"date":"August 18, 2019","title":"Implementing Scrum - A case study","description":"How changing our product/software development process completely changed the team engament and results"}}},{"node":{"excerpt":"At JAX London a few weeks ago I attended the talk of @danielbryantuk about Continuous Delivery With Containers, where he gave a few samples…","fields":{"slug":"/2017/a-practical-guide-to-cd-java-applications/"},"frontmatter":{"date":"October 19, 2017","title":"A Practical guide to CD Java Applications","description":"At JAX London 2017 there was an interesting talk about the state of the art on CD for Java Apps"}}},{"node":{"excerpt":"Originally published at foodora/foodpanda tech blogIn October 2017 some of the top tech companies got together in the JAX London a…","fields":{"slug":"/2017/jax-london/"},"frontmatter":{"date":"October 15, 2017","title":"Jax London 2017 - Conference Highlights","description":"In October 2017 some of the top tech companies got together in the JAX London a conference about JAVA, microservices, continuous delivery and DevOps, and foodora tech was also there to check the latest releases and trends for the future of JAVA."}}},{"node":{"excerpt":"Originally published at foodora/foodpanda tech blogWe strongly believe that is important to keep up to date in our tech stack and be close…","fields":{"slug":"/2016/building-scalable-apis-with-aws-api-gateway/"},"frontmatter":{"date":"September 16, 2016","title":"Building Scalable APIs with AWS API Gateway","description":"There is a lot of excitement around serverless architecture and it is for a good reason, abstracting the tedious details of configuration and management of your architecture can make a lot of sense for the right application, the AWS API gateway is one of the several tools that allow you this."}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true,"slug":"/","langKey":"en"}}