{"data":{"site":{"siteMetadata":{"title":"Vitor Reis Blog","author":"Vitor Reis"}},"markdownRemark":{"id":"451e9cb3-7cbd-51cd-9a6e-bcec2e9a8a2c","excerpt":"Originally published at foodora/foodpanda tech blogWe strongly believe that is important to keep up to date in our tech stack and be close to the tech community…","html":"<blockquote>\n<p>Originally published at <a href=\"https://tech.foodora.com/building-scalable-apis-with-aws-api-gateway\">foodora/foodpanda tech blog</a></p>\n</blockquote>\n<p>We strongly believe that is important to keep up to date in our tech stack and be close to the tech community. Therefore foodpanda hosted the AWS User Group Berlin edition of November 2016.\nAt this event, we were invited to share our experience using serverless architecture with AWS API Gateway.</p>\n<p><img src=\"./building-scalable-apis-photo.jpeg\" alt=\"Foodpanda Tech speaking about AWS API Gateway\"></p>\n<h2>About API Gateway</h2>\n<p>There is a lot of excitement around serverless architecture and it is for a good reason, abstracting the tedious details of configuration and management of your architecture can make a lot of sense for the right application, the AWS API gateway is one of the several tools that allow you this.</p>\n<p>Amazon API Gateway is a fully managed service that makes it easy for developers to create, publish, maintain, monitor, and secure APIs at any scale, it handles all the tasks involved in accepting and processing up to hundreds thousands of concurrent API calls, including:</p>\n<p>Traffic management\nAuthorization and access control\nMonitoring\nAPI version management</p>\n<p>You pay only for the API calls you receive and the amount of data transferred out.\n<img src=\"./amazon-gateway-api-call-flow.jpg\" alt=\"Amazon API Gateway call flow\"></p>\n<h2>Reasons to choose API Gateway</h2>\n<p>Speed and reduced infrastructure footprint are the 2 biggest reasons to choose to use API Gateway. When you choose API gateway all the servers, security, scaling and monitoring are managed for you.</p>\n<p>The API gateway is designed for the developer who wants to quickly build APIs while reducing the cross team developing efforts and increase the time to market for your applications.</p>\n<p>Good for:</p>\n<ul>\n<li>Greenfield projects</li>\n<li>Building MVP to quickly gauge customer interest</li>\n<li>Fast</li>\n<li>Minimal backend investment</li>\n</ul>\n<h2>Reasons NOT to choose API Gateway</h2>\n<p>Since servers, security, scaling and monitoring are managed for you this means also that you don’t have many inputs of how those features are fulfilled. If your application has a unique constraint that can’t be fulfilled with the managed services, API Gateway may not be a good fit.</p>\n<p>E.g.: If your application has the requirement of provide audit logs from the underlying hosting services, or, if you are in a specific security environment that does not allow hosted services.</p>\n<p>If your organization has a strong, proven infrastructure and a DevOps organization that can provide similar services, introducing a new technology might not be good.</p>\n<h2>Code and slides</h2>\n<p>The code samples are available on <a href=\"https://github.com/vitorreis/aws-examples\">GitHub</a> and <a href=\"https://docs.google.com/presentation/d/1E2r8cTIDqU2utB1UjRL08-j6GYefNVwVi_HMegpf1dA/edit\">slides on google docs</a>.</p>","frontmatter":{"title":"Building Scalable APIs with AWS API Gateway","date":"September 16, 2016","description":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/building-scalable-apis-with-aws-api-gateway/","previous":{"fields":{"slug":"/jax-london-2017/"},"frontmatter":{"title":"Building Scalable APIs with AWS API Gateway"}},"next":{"fields":{"slug":"/a-practical-guide-to-cd-java-applications/"},"frontmatter":{"title":"A Practical guide to CD Java Applications"}}}}